In [310]:
import pandas as pd
import numpy as np
from numpy import nan as NA
import re

In [3]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [8]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [10]:
obj3 = obj3.reindex(range(6),method='ffill')

obj3

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [12]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [13]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [14]:
states = ['Texas', 'Utah', 'California']

frame2 = frame2.reindex(columns=states)
frame2

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [15]:
frame2.loc[['a','c','c','d'],states]

   Texas  Utah  California
a    1.0   NaN         2.0
c    4.0   NaN         5.0
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [17]:
obj4 = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj4

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [19]:
obj5 = obj4.drop('c')
obj5

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [22]:
obj5.drop(['d','e'])

a    0.0
b    1.0
dtype: float64

In [23]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio','Colarado','Utah','New York'],
                   columns=['one','two','three','four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colarado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
data.drop(['Ohio','Colarado'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
data.drop(['one'],axis=1)

          two  three  four
Ohio        1      2     3
Colarado    5      6     7
Utah        9     10    11
New York   13     14    15

In [28]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colarado    4      6
Utah        8     10
New York   12     14

In [30]:
obj.drop('a',inplace=True)
obj

d    4.5
b    7.2
c    3.6
dtype: float64

In [31]:
obj6 = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj6

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [32]:
obj6['b']

1.0

In [33]:
obj6[2:4]

c    2.0
d    3.0
dtype: float64

In [34]:
obj6[['b','c','d']]

b    1.0
c    2.0
d    3.0
dtype: float64

In [35]:
obj6[[1,3]]

C:\Users\SKUP\AppData\Local\Temp/ipykernel_27708/3350366021.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj6[[1,3]]

b    1.0
d    3.0
dtype: float64

In [36]:
obj6[obj6<1]

a    0.0
dtype: float64

In [37]:
obj6['a':'c'] = 6

obj6

a    6.0
b    6.0
c    6.0
d    3.0
dtype: float64

In [38]:
data2 = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data2['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [41]:
data2[['two','three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [42]:
data2[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [43]:
data2[data2['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
data2 < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [46]:
data2[data2<5] = 0
data2

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [47]:
data2.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [48]:
data2.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [49]:
data2.iloc[[1,2,3],[2,3]]

          three  four
Colorado      6     7
Utah         10    11
New York     14    15

In [51]:
data2.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [53]:
data2.iloc[:,:3][data2.three>3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [54]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [55]:
ser[-1]

KeyError: -1

In [56]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

C:\Users\SKUP\AppData\Local\Temp/ipykernel_27708/2842014175.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [59]:
ser2.iloc[:2]

a    0.0
b    1.0
dtype: float64

In [60]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [61]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])

s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [62]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [63]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [64]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list('abcde'))

df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [65]:
df2.loc[1,'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [66]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [68]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [69]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [71]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [73]:
arr = np.arange(12.).reshape((3, 4))
arr, arr[0]

(array([[ 0.,  1.,  2.,  3.],
        [ 4.,  5.,  6.,  7.],
        [ 8.,  9., 10., 11.]]),
 array([0., 1., 2., 3.]))

In [74]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [75]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [76]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [77]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [78]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [79]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [80]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [82]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [81]:
frame.sub(series3,axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [83]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.191506 -0.367469 -0.925172
Ohio   -1.943074 -0.583152  0.581288
Texas  -0.933109  0.439402  1.160405
Oregon -1.568613  0.024683 -0.621386

In [84]:
np.abs(frame)

               b         d         e
Utah    0.191506  0.367469  0.925172
Ohio    1.943074  0.583152  0.581288
Texas   0.933109  0.439402  1.160405
Oregon  1.568613  0.024683  0.621386

In [86]:
f = lambda x: x.max() - x.min()

In [87]:
frame.apply(f)

b    1.751569
d    1.022554
e    2.085577
dtype: float64

In [88]:
frame.apply(f,axis='columns')

Utah      0.733667
Ohio      2.524362
Texas     2.093514
Oregon    1.593297
dtype: float64

In [89]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [90]:
frame.apply(f)

            b         d         e
min -1.943074 -0.583152 -0.925172
max -0.191506  0.439402  1.160405

In [91]:
format = lambda x: '%.2f' % x

In [92]:
frame.applymap(format)

C:\Users\SKUP\AppData\Local\Temp/ipykernel_27708/304758519.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(format)

            b      d      e
Utah    -0.19  -0.37  -0.93
Ohio    -1.94  -0.58   0.58
Texas   -0.93   0.44   1.16
Oregon  -1.57   0.02  -0.62

In [93]:
frame['e'].map(format)

Utah      -0.93
Ohio       0.58
Texas      1.16
Oregon    -0.62
Name: e, dtype: object

In [94]:
obj7 =  pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj7.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [95]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [96]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [97]:
obj8 = pd.Series([4, 7, -3, 2])
obj8.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [98]:
obj9 = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj9.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [99]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [101]:
frame.sort_values(by='a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [102]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [103]:
obj10 = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj10.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [104]:
obj10.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [106]:
obj10.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [107]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [108]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [109]:
obj11 = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj11

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [110]:
obj11['a']

a    0
a    1
dtype: int64

In [111]:
obj11.index.is_unique

False

In [112]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.662111  0.715356 -0.588153
a -0.740076 -1.382938  0.352721
b  0.357794  0.133291  0.075123
b  0.646297  1.133801 -0.285275

In [114]:
df.loc['b']

          0         1         2
b  0.357794  0.133291  0.075123
b  0.646297  1.133801 -0.285275

In [117]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],
index=['a', 'b', 'c', 'd'],columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [116]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [118]:
df.mean(axis='columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [119]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [120]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [121]:
df.idxmax()

one    b
two    d
dtype: object

In [122]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [123]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [124]:
obj12 = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj12

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [125]:
obj12.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [126]:
import pandas_datareader.data as web

In [146]:
from pandas_datareader import data as web
import yfinance as yf

yf.pdr_override()
# import pandas.io.data as web
import datetime

#start = datetime.datetime(2010, 1, 1)
#end = datetime.datetime(2017, 6, 1)

all_data={}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOGL']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = pd.DataFrame({tic: data['Adj Close'] 
                   for tic, data in all_data.items()})
volume = pd.DataFrame({tic: data['Volume']
                     for tic, data in all_data.items()})

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

In [149]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT     GOOGL
Date
2024-01-22  0.012163  0.007873 -0.005418 -0.002664
2024-01-23  0.006653  0.006422  0.006028  0.007192
2024-01-24 -0.003484 -0.000058  0.009175  0.011289
2024-01-25 -0.001697  0.094866  0.005738  0.021318
2024-01-26 -0.009013 -0.015806 -0.002322  0.002107

In [150]:
returns['MSFT'].corr(returns['IBM'])

0.441212501189748

In [151]:
returns['MSFT'].cov(returns['IBM'])

0.00015990454550134602

In [152]:
returns.corr()

           AAPL       IBM      MSFT     GOOGL
AAPL   1.000000  0.368511  0.430392  0.519165
IBM    0.368511  1.000000  0.441213  0.396195
MSFT   0.430392  0.441213  1.000000  0.562105
GOOGL  0.519165  0.396195  0.562105  1.000000

In [153]:
returns.cov()

           AAPL       IBM      MSFT     GOOGL
AAPL   0.000784  0.000172  0.000248  0.000207
IBM    0.000172  0.000251  0.000160  0.000110
MSFT   0.000248  0.000160  0.000449  0.000186
GOOGL  0.000207  0.000110  0.000186  0.000374

In [154]:
returns.corrwith(returns['IBM'])

AAPL     0.368511
IBM      1.000000
MSFT     0.441213
GOOGL    0.396195
dtype: float64

In [155]:
obj12 = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj12

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [157]:
obj12.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [158]:
obj12.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [159]:
pd.value_counts(obj12,sort=False)

C:\Users\SKUP\AppData\Local\Temp/ipykernel_27708/1482091940.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj12,sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [163]:
mask = obj12.isin(['b','d'])
obj12[mask]

2    d
5    b
6    b
dtype: object

In [164]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])

pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [165]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [169]:
result = data.apply(pd.value_counts).fillna(0)
result

C:\Users\SKUP\AppData\Local\Temp/ipykernel_27708/1382616601.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [170]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [171]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [172]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [174]:
data = pd.Series([1,NA,2,3,NA,5])
data

0    1.0
1    NaN
2    2.0
3    3.0
4    NaN
5    5.0
dtype: float64

In [175]:
data.dropna()

0    1.0
2    2.0
3    3.0
5    5.0
dtype: float64

In [177]:
data[data.notnull()]

0    1.0
2    2.0
3    3.0
5    5.0
dtype: float64

In [178]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [179]:
data_cleaned = data.dropna()
data_cleaned

     0    1    2
0  1.0  6.5  3.0

In [180]:
data_cleaned1 = data.dropna(how='all')
data_cleaned1

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [181]:
data_cleaned2 = data.dropna(axis=1,how='all')
data_cleaned2

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [183]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  1.575035 -0.600201 -0.896061
1 -1.632935 -0.504998  0.449090
2 -1.753306 -1.505539  0.835751
3  2.052326 -0.948669  1.774962
4 -0.214350 -1.464672  0.249078
5  0.944906  0.960142 -0.981264
6 -0.445249 -0.885275 -0.522762

In [185]:
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA

df

          0         1         2
0  1.575035       NaN       NaN
1 -1.632935       NaN       NaN
2 -1.753306       NaN  0.835751
3  2.052326       NaN  1.774962
4 -0.214350 -1.464672  0.249078
5  0.944906  0.960142 -0.981264
6 -0.445249 -0.885275 -0.522762

In [186]:
df.dropna()

          0         1         2
4 -0.214350 -1.464672  0.249078
5  0.944906  0.960142 -0.981264
6 -0.445249 -0.885275 -0.522762

In [187]:
df.dropna(thresh=2)

          0         1         2
2 -1.753306       NaN  0.835751
3  2.052326       NaN  1.774962
4 -0.214350 -1.464672  0.249078
5  0.944906  0.960142 -0.981264
6 -0.445249 -0.885275 -0.522762

In [188]:
df.fillna(0)

          0         1         2
0  1.575035  0.000000  0.000000
1 -1.632935  0.000000  0.000000
2 -1.753306  0.000000  0.835751
3  2.052326  0.000000  1.774962
4 -0.214350 -1.464672  0.249078
5  0.944906  0.960142 -0.981264
6 -0.445249 -0.885275 -0.522762

In [189]:
df.fillna({1:0.5,2:0})

          0         1         2
0  1.575035  0.500000  0.000000
1 -1.632935  0.500000  0.000000
2 -1.753306  0.500000  0.835751
3  2.052326  0.500000  1.774962
4 -0.214350 -1.464672  0.249078
5  0.944906  0.960142 -0.981264
6 -0.445249 -0.885275 -0.522762

In [191]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

df

          0         1         2
0  1.406776 -1.026305 -0.370648
1 -0.784211 -1.601513  1.768263
2 -1.332761       NaN -0.329568
3  1.269464       NaN  1.436467
4  1.541177       NaN       NaN
5 -0.813583       NaN       NaN

In [193]:
df.fillna(method='ffill',limit=2)

C:\Users\SKUP\AppData\Local\Temp/ipykernel_27708/2005079682.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill',limit=2)

          0         1         2
0  1.406776 -1.026305 -0.370648
1 -0.784211 -1.601513  1.768263
2 -1.332761 -1.601513 -0.329568
3  1.269464 -1.601513  1.436467
4  1.541177       NaN  1.436467
5 -0.813583       NaN  1.436467

In [194]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [195]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [196]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [197]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [198]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [200]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [203]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [205]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 
                                'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [206]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [207]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [208]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [209]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [210]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [211]:
data.replace(-999., np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [212]:
data.replace([-999.,1000.],np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [213]:
data.replace({-999.0:0,-1000.:np.nan})

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

In [214]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [215]:
transform = lambda x: x.upper()

In [216]:
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [219]:
data.index = data.index.map(transform)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [222]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [227]:
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [229]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18,25,35,60,100]

cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [230]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [231]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [232]:
pd.value_counts(cats)

C:\Users\SKUP\AppData\Local\Temp/ipykernel_27708/1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [233]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [235]:
groupnames = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

pd.cut(ages,bins,labels=groupnames)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [246]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0   -0.663133  0.081800  0.342529 -0.316100
1   -1.687672  1.350762  1.076923  1.159301
2   -1.359526 -1.628173  0.219070 -1.500075
3   -0.257443  0.480438 -0.790364 -2.748313
4    1.117213 -0.268193  2.398822 -1.122553
..        ...       ...       ...       ...
995  0.615096  0.452337 -0.655980  0.167421
996  0.670852 -0.129812  0.115128  1.729180
997  0.246109 -1.584944  1.287879  1.394723
998 -0.207752  0.374730 -0.473465 -0.074562
999 -0.156848 -1.970610 -0.066688 -0.284514

[1000 rows x 4 columns]

In [237]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.018050    -0.015640     0.017125     0.055606
std       0.992982     1.000758     0.981955     0.997850
min      -3.011514    -3.508242    -2.836840    -2.841556
25%      -0.703886    -0.645932    -0.651484    -0.648852
50%      -0.024980    -0.031617     0.019149     0.052705
75%       0.705091     0.605431     0.721138     0.767667
max       3.365312     4.012467     3.126456     2.852353

In [239]:
col = data[2]
col[np.abs(col)>3]

102    3.126456
Name: 2, dtype: float64

In [250]:
data[(np.abs(data)>3).any(axis=1)]

            0         1         2         3
208 -0.299838  0.468020 -3.048510 -1.481135
410 -0.796025 -3.126523  0.735248 -1.186672
528 -0.321528 -0.128066 -0.055386  3.553798
777 -0.340595 -0.328255  0.187962 -3.075278
842 -1.246446 -0.396367 -3.089066 -1.183735
871  0.081726 -0.803364 -0.622435  3.129903
901  0.103682  0.030268  1.369081 -3.249914

In [251]:
data[(np.abs(data)>3)] = np.sign(data)*3
data

            0         1         2         3
0   -0.663133  0.081800  0.342529 -0.316100
1   -1.687672  1.350762  1.076923  1.159301
2   -1.359526 -1.628173  0.219070 -1.500075
3   -0.257443  0.480438 -0.790364 -2.748313
4    1.117213 -0.268193  2.398822 -1.122553
..        ...       ...       ...       ...
995  0.615096  0.452337 -0.655980  0.167421
996  0.670852 -0.129812  0.115128  1.729180
997  0.246109 -1.584944  1.287879  1.394723
998 -0.207752  0.374730 -0.473465 -0.074562
999 -0.156848 -1.970610 -0.066688 -0.284514

[1000 rows x 4 columns]

In [255]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1 -1.0  1.0  1.0  1.0
2 -1.0 -1.0  1.0 -1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0 -1.0  1.0 -1.0

In [256]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [258]:
sampler = np.random.permutation(5)
sampler

array([4, 3, 1, 0, 2])

In [259]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11

In [260]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11

In [261]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10,replace=True)
draws

1    7
1    7
3    6
1    7
3    6
1    7
4    4
0    5
1    7
3    6
dtype: int64

In [262]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [264]:
pd.get_dummies(df['key'],dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [266]:
dummies = pd.get_dummies(df['key'],prefix='key',dtype=float)
dummies

   key_a  key_b  key_c
0    0.0    1.0    0.0
1    0.0    1.0    0.0
2    1.0    0.0    0.0
3    0.0    0.0    1.0
4    1.0    0.0    0.0
5    0.0    1.0    0.0

In [267]:
df_with_dummies = df[['data1']].join(dummies)
df_with_dummies

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [269]:
mnames = ['movie_id', 'title', 'genres']

In [275]:
movies = pd.read_table("C:/Users/SKUP/OneDrive - Capco/Desktop/DataAnalysis/movielens/movies.dat",
                      sep='::',header=None,names=mnames)

C:\Users\SKUP\AppData\Local\Temp/ipykernel_27708/3254078679.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table("C:/Users/SKUP/OneDrive - Capco/Desktop/DataAnalysis/movielens/movies.dat",

In [276]:
movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [277]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
    
    
genres = pd.unique(all_genres)

C:\Users\SKUP\AppData\Local\Temp/ipykernel_27708/3925072096.py:6: FutureWarning: unique with argument that is not not a Series, Index, ExtensionArray, or np.ndarray is deprecated and will raise in a future version.
  genres = pd.unique(all_genres)

In [278]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [280]:
zero_matrix = np.zeros((len(movies),len(genres)))

In [285]:
dummies = pd.DataFrame(zero_matrix,columns=genres)

In [286]:
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [287]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [288]:
for i,gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1
    
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [289]:
movies_windic = movies.join(dummies.add_prefix('genre_'))
movies_windic

,movie_id,title,genres,genre_Animation,genre_Children's,genre_Comedy,genre_Adventure,genre_Fantasy,genre_Romance,genre_Drama,...,genre_Crime,genre_Thriller,genre_Horror,genre_Sci-Fi,genre_Documentary,genre_War,genre_Musical,genre_Mystery,genre_Film-Noir,genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [290]:
np.random.seed(12345)

In [292]:
values = np.random.rand(10)
values

array([0.74771481, 0.96130674, 0.0083883 , 0.10644438, 0.29870371,
       0.65641118, 0.80981255, 0.87217591, 0.9646476 , 0.72368535])

In [293]:
bins =  [0, 0.2, 0.4, 0.6, 0.8, 1]

In [295]:
pd.get_dummies(pd.cut(values,bins),dtype=float)

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0         0.0         0.0         0.0         1.0         0.0
1         0.0         0.0         0.0         0.0         1.0
2         1.0         0.0         0.0         0.0         0.0
3         1.0         0.0         0.0         0.0         0.0
4         0.0         1.0         0.0         0.0         0.0
5         0.0         0.0         0.0         1.0         0.0
6         0.0         0.0         0.0         0.0         1.0
7         0.0         0.0         0.0         0.0         1.0
8         0.0         0.0         0.0         0.0         1.0
9         0.0         0.0         0.0         1.0         0.0

In [297]:
val = 'a,b, guido'

val.split(',')

['a', 'b', ' guido']

In [299]:
pieces = [x.strip() for x in val.split(',')]

In [300]:
first,second,third = pieces

In [301]:
first+'::'+second+'::'+third

'a::b::guido'

In [302]:
'::'.join(pieces)

'a::b::guido'

In [303]:
val.index(',')

1

In [304]:
val.index(':')

ValueError: substring not found

In [307]:
val.find(':')

-1

In [308]:
val.count(',')

2

In [309]:
val.replace(',',"::")

'a::b:: guido'

In [311]:
text = "foo bar\t baz \tqux"

re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [312]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [314]:
regex.findall(text)

[' ', '\t ', ' \t']

In [315]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [316]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [317]:
regex = re.compile(pattern,flags=re.IGNORECASE)

In [318]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [319]:
m = regex.search(text)
m

In [320]:
text[m.start():m.end()]

'dave@google.com'

In [322]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [323]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [324]:
regex = re.compile(pattern,flags=re.IGNORECASE)

In [326]:
m = regex.match('ryan@yahoo.com')
m.groups()

('ryan', 'yahoo', 'com')

In [327]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [328]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}

In [329]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [330]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [331]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [332]:
data.str.findall(pattern,re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object